InformationRegisters/ДанныеОбработанныеВЦентральномУзлеРИБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ДанныеОбработанныеВЦентральномУзлеРИБ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗначенияОтборовНезависимогоРегистра</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>УзелПланаОбмена</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектМетаданных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Очередь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючУникальности</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ДанныеОбработанныеВЦентральномУзлеРИБ/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Заполняет регистр обновленных данных для передачи в подчиненные узлы РИБ.
//
// Параметры:
//  Очередь - Число - очередь обработки, в которой выполняется текущий обработчик.
//  Данные  - Ссылка, Массив, НаборДанных - данные, по которым нужно зарегистрировать изменения.
//            Регистрация по независимому регистру сведений не поддерживается.
//  ДополнительныеПараметры - Структура - см. ОбновлениеИнформационнойБазы.ДополнительныеПараметрыОтметкиОбработки.
//
Процедура ОтметитьВыполнениеОбработки(Очередь, Данные, ДополнительныеПараметры) Экспорт
	Если (ПараметрыСеанса.ПараметрыОбработчикаОбновления.ЗапускатьТолькоВГлавномУзле
			И Не БазоваяПодсистемаСерверПовтИсп.ИспользуетсяРИБ())
			Или (Не ПараметрыСеанса.ПараметрыОбработчикаОбновления.ЗапускатьТолькоВГлавномУзле И Не БазоваяПодсистемаСерверПовтИсп.ИспользуетсяРИБ("СФильтром")) Тогда
		Возврат;
	КонецЕсли;

	ТипДанных = ТипЗнч(Данные);

	Если ТипДанных = Тип("Массив") И Данные.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Если ПараметрыСеанса.ПараметрыОбработчикаОбновления.ЗапускатьТолькоВГлавномУзле Тогда
		УзлыРИБ = БазоваяПодсистемаСерверПовтИсп.УзлыРИБ();
	Иначе
		УзлыРИБ = БазоваяПодсистемаСерверПовтИсп.УзлыРИБ("СФильтром");
	КонецЕсли;

	Если УзлыРИБ.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Если ДополнительныеПараметры.ЭтоДвижения Или ДополнительныеПараметры.ЭтоНезависимыйРегистрСведений Тогда
		ИдентификаторОбъектаМетаданных = БазоваяПодсистемаСервер.ИдентификаторОбъектаМетаданных(ДополнительныеПараметры.ПолноеИмяРегистра);
	Иначе
		Если ТипДанных = Тип("Массив") Тогда
			ИдентификаторОбъектаМетаданных = Неопределено;
		Иначе
			ИдентификаторОбъектаМетаданных = БазоваяПодсистемаСервер.ИдентификаторОбъектаМетаданных(ТипДанных);
		КонецЕсли;
	КонецЕсли;

	НаборДанных = СоздатьНаборЗаписей();

	Если ЗначениеЗаполнено(ИдентификаторОбъектаМетаданных) Тогда
		НаборДанных.Отбор.ОбъектМетаданных.Установить(ИдентификаторОбъектаМетаданных);
	КонецЕсли;

	НаборДанных.Отбор.Очередь.Установить(Очередь);

	Если ДополнительныеПараметры.ЭтоДвижения Тогда
		ДобавитьДанныеВНабор(УзлыРИБ, НаборДанных, Данные);
	ИначеЕсли ДополнительныеПараметры.ЭтоНезависимыйРегистрСведений Тогда
		Для Каждого СтрТабл Из Данные Цикл
			СтруктураЗначенийИзмерений = Новый Структура;
			ГУИД                       = Новый УникальныйИдентификатор;

			НаборДанных.Отбор.КлючУникальности.Установить(ГУИД);

			Для Каждого ЭлементОтбора Из Данные.Колонки Цикл
				СтруктураЗначенийИзмерений.Вставить(ЭлементОтбора.Имя, СтрТабл[ЭлементОтбора.Имя]);
			КонецЦикла;

			Для Каждого УзелРИБ Из УзлыРИБ Цикл
				НоваяСтрока										= НаборДанных.Добавить();
				НоваяСтрока.УзелПланаОбмена                     = УзелРИБ.Значение;
				НоваяСтрока.ОбъектМетаданных                    = ИдентификаторОбъектаМетаданных;
				НоваяСтрока.КлючУникальности                    = ГУИД;
				НоваяСтрока.Очередь                             = Очередь;
				НоваяСтрока.ЗначенияОтборовНезависимогоРегистра = Новый ХранилищеЗначения(СтруктураЗначенийИзмерений, Новый СжатиеДанных(9));
			КонецЦикла;

			ЗаписатьНаборИсключивСтандартнуюРегистрациюИзменений(НаборДанных, УзлыРИБ);
		КонецЦикла;
	Иначе
		Если ТипЗнч(Данные) <> Тип("Массив") Тогда
			ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипДанных);

			Если Метаданные.РегистрыСведений.Содержит(ОбъектМетаданных) И ОбъектМетаданных.РежимЗаписи = Метаданные.СвойстваОбъектов.РежимЗаписиРегистра.Независимый Тогда
				СтруктураЗначенийИзмерений = Новый Структура;
				ГУИД                       = Новый УникальныйИдентификатор;

				НаборДанных.Отбор.КлючУникальности.Установить(ГУИД);

				Для Каждого ЭлементОтбора Из Данные.Отбор Цикл
					СтруктураЗначенийИзмерений.Вставить(ЭлементОтбора.Имя, ЭлементОтбора.Значение);
				КонецЦикла;

				Для Каждого УзелРИБ Из УзлыРИБ Цикл
					НоваяСтрока										= НаборДанных.Добавить();
					НоваяСтрока.УзелПланаОбмена                     = УзелРИБ.Значение;
					НоваяСтрока.ОбъектМетаданных                    = ИдентификаторОбъектаМетаданных;
					НоваяСтрока.КлючУникальности                    = ГУИД;
					НоваяСтрока.Очередь                             = Очередь;
					НоваяСтрока.ЗначенияОтборовНезависимогоРегистра = Новый ХранилищеЗначения(СтруктураЗначенийИзмерений, Новый СжатиеДанных(9));
				КонецЦикла;

				ЗаписатьНаборИсключивСтандартнуюРегистрациюИзменений(НаборДанных, УзлыРИБ);

				Возврат;
			КонецЕсли;

			ДобавитьДанныеВНабор(УзлыРИБ, НаборДанных, Данные, ОбъектМетаданных);
		Иначе
			ДобавитьДанныеВНабор(УзлыРИБ, НаборДанных, Данные, , Очередь);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ДобавитьДанныеВНабор(УзлыРИБ, НаборДанных, Данные, ОбъектМетаданных = Неопределено, Очередь = Неопределено)
	Если ТипЗнч(Данные) = Тип("Массив") Тогда
		Для Каждого СтрокаМассива Из Данные Цикл
			НаборДанных = СоздатьНаборЗаписей();
			НаборДанных.Отбор.Данные.Установить(СтрокаМассива);
			НаборДанных.Отбор.Очередь.Установить(Очередь);
			НаборДанных.Отбор.ОбъектМетаданных.Установить(БазоваяПодсистемаСервер.ИдентификаторОбъектаМетаданных(ТипЗнч(СтрокаМассива)));

			Для Каждого УзелРИБ Из УзлыРИБ Цикл
				НоваяСтрока						= НаборДанных.Добавить();
				НоваяСтрока.УзелПланаОбмена		= УзелРИБ.Значение;
				НоваяСтрока.ОбъектМетаданных	= НаборДанных.Отбор.ОбъектМетаданных.Значение;
				НоваяСтрока.Данные				= СтрокаМассива;
				НоваяСтрока.Очередь				= НаборДанных.Отбор.Очередь.Значение;
			КонецЦикла;

			ЗаписатьНаборИсключивСтандартнуюРегистрациюИзменений(НаборДанных, УзлыРИБ);
		КонецЦикла;
	Иначе
		Значение = Неопределено;

		Если ОбъектМетаданных = Неопределено Тогда
			ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗнч(Данные));
		КонецЕсли;

		Если БазоваяПодсистемаСервер.ЭтоСсылка(ТипЗнч(Данные)) Тогда
			Значение = Данные;
		ИначеЕсли БазоваяПодсистемаСервер.ЭтоОбъектСсылочногоТипа(ОбъектМетаданных) Тогда
			Значение = Данные.Ссылка;
		Иначе
			Значение = Данные.Отбор.Регистратор.Значение;
		КонецЕсли;

		НаборДанных.Отбор.Данные.Установить(Значение);

		Если Не НаборДанных.Отбор.ОбъектМетаданных.Использование Или Не ЗначениеЗаполнено(НаборДанных.Отбор.ОбъектМетаданных.Значение) Тогда
			НаборДанных.Отбор.ОбъектМетаданных.Установить(БазоваяПодсистемаСервер.ИдентификаторОбъектаМетаданных(ТипЗнч(Значение)));
		КонецЕсли;

		Для Каждого УзелРИБ Из УзлыРИБ Цикл
			НоваяСтрока						= НаборДанных.Добавить();
			НоваяСтрока.УзелПланаОбмена		= УзелРИБ.Значение;
			НоваяСтрока.ОбъектМетаданных	= НаборДанных.Отбор.ОбъектМетаданных.Значение;
			НоваяСтрока.Данные				= Значение;
			НоваяСтрока.Очередь				= НаборДанных.Отбор.Очередь.Значение;
		КонецЦикла;

		ЗаписатьНаборИсключивСтандартнуюРегистрациюИзменений(НаборДанных, УзлыРИБ);
	КонецЕсли;
КонецПроцедуры

Процедура ЗаписатьНаборИсключивСтандартнуюРегистрациюИзменений(НаборДанных, УзлыРИБ)
	// Записываем набор, заменяя стандартную логику регистрации собственной.
	РегистрируемыйНабор = СоздатьНаборЗаписей();
	Для Каждого ЭлементОтбора Из НаборДанных.Отбор Цикл
		РегистрируемыйНабор.Отбор[ЭлементОтбора.Имя].Установить(ЭлементОтбора.Значение);
	КонецЦикла;

	Для Каждого ЭлементСписка Из УзлыРИБ Цикл
		УзелРИБ = ЭлементСписка.Значение;
		РегистрируемыйНабор.Отбор.УзелПланаОбмена.Установить(УзелРИБ);
		ПланыОбмена.ЗарегистрироватьИзменения(УзелРИБ, РегистрируемыйНабор);
	КонецЦикла;

	НаборДанных.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов");
	НаборДанных.Записать();
КонецПроцедуры

#КонецЕсли
